04_perforatedPlate/21_noTextureZigZagPerforationV2/01_baseCaseInit/Allrun.pre
#!/bin/sh
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# create mesh
runApplication blockMesh
# convert holes to cyclic patches
runApplication createPatch -overwrite
# refine the mesh
runApplication snappyHexMesh -overwrite

# copy IC
mkdir 0
cp -rf 0.org/* 0

# set fields values
#~ runApplication setFields
#~ mv log.setFields log.setFieldsPreDecomposition


paraFoam -touch
